index.org
:PROPERTIES:
:ID:       7e8572a8-fea8-44e8-a496-b41776f953f0
:END:
#+TITLE: Maxwell Morris
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* About Me
I am an electrical engineering student at Curtin.


* Posts
- [[org:/Posts/FirstPost.html][First Post]]

* TODO Current TODO List
- [ ] Need to fix invalidation issues in the pipeline
- [ ] Need to make the site pretty
- [ ] Create a suitable structure for the website
- [ ] Write up a personal intro
- [ ] Stream line the upload sequence
- [ ] Fix issue where only the www.maxwellmorris.net site updates not maxwellmorris.net
- [ ] Another item


* Creating a lambda function to invalidate the website on a github push
<2022-07-17 Sun>
References: [[https://medium.com/fullstackai/aws-creating-a-cloudfront-invalidation-in-codepipeline-using-lambda-actions-49c1fd3a3c31][Jacob Unna]],

Tools: Python, boto.

Boto is the library that allows for you to control AWS services.
#+begin_src python
import json
import boto3

code_pipeline = boto3.client("codepipeline")
cloud_front = boto3.client("cloudfront")


#+end_src
