index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-17 Sun 19:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Maxwell Morris</title>
<meta name="author" content="Maxwell Morris" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Maxwell Morris</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org44d9d14">1. About Me</a></li>
<li><a href="#orgb610649">2. Posts</a></li>
<li><a href="#orgb13439a">3. <span class="todo TODO">TODO</span> Current TODO List</a></li>
<li><a href="#org7b6849a">4. Creating a lambda function to invalidate the website on a github push</a></li>
</ul>
</div>
</div>

<div id="outline-container-org44d9d14" class="outline-2">
<h2 id="org44d9d14"><span class="section-number-2">1.</span> About Me</h2>
<div class="outline-text-2" id="text-1">
<p>
I am an electrical engineering student at Curtin.
</p>
</div>
</div>


<div id="outline-container-orgb610649" class="outline-2">
<h2 id="orgb610649"><span class="section-number-2">2.</span> Posts</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="/Posts/FirstPost.html">First Post</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb13439a" class="outline-2">
<h2 id="orgb13439a"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Current TODO List</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Need to fix invalidation issues in the pipeline</li>
<li class="off"><code>[&#xa0;]</code> Need to make the site pretty</li>
<li class="off"><code>[&#xa0;]</code> Create a suitable structure for the website</li>
<li class="off"><code>[&#xa0;]</code> Write up a personal intro</li>
<li class="off"><code>[&#xa0;]</code> Stream line the upload sequence</li>
<li class="off"><code>[&#xa0;]</code> Fix issue where only the www.maxwellmorris.net site updates not maxwellmorris.net</li>
<li class="off"><code>[&#xa0;]</code> Another item</li>
</ul>
</div>
</div>


<div id="outline-container-org7b6849a" class="outline-2">
<h2 id="org7b6849a"><span class="section-number-2">4.</span> Creating a lambda function to invalidate the website on a github push</h2>
<div class="outline-text-2" id="text-4">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-17 Sun&gt;</span></span>
References: <a href="https://medium.com/fullstackai/aws-creating-a-cloudfront-invalidation-in-codepipeline-using-lambda-actions-49c1fd3a3c31">Jacob Unna</a>,
</p>

<p>
Tools: Python, boto.
</p>

<p>
Boto is the library that allows for you to control AWS services.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff79c6;">import</span> json
<span style="color: #ff79c6;">import</span> boto3

<span style="color: #ffc9e8;">code_pipeline</span> = boto3.client(<span style="color: #f1fa8c;">"codepipeline"</span>)
<span style="color: #ffc9e8;">cloud_front</span> = boto3.client(<span style="color: #f1fa8c;">"cloudfront"</span>)


</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Maxwell Morris</p>
<p class="date">Created: 2022-07-17 Sun 19:50</p>
</div>
</body>
</html>
